app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
        #if new fb user is signed in now, redirect to start page
		if(session[:fb_id])
			session[:id] = User.find_by_fbid(@me['id']).id
            current_user = User.find(session[:id])