app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "createScore" DESC LIMIT 8 OFFSET 0
SELECT "users".* FROM "users" ORDER BY "destroyScore" DESC LIMIT 8 OFFSET 0
---
  def index
    @title = "All users"
    @top_builder = User.paginate(:all, :per_page => 8, :page => params[:builder], :order => 'createScore DESC')
    @top_destroyer = User.paginate(:all, :per_page => 8, :page => params[:destroyer], :order => 'destroyScore DESC')

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin", "fbid", "createScore", "destroyScore", "isFacebook") VALUES ('New User', 'user@example.com', '2011-02-08 18:07:43.459373', '2011-02-08 18:07:43.459373', '074352abc76fad35c196856c25e795da55a9bea8c6ed75ca1f0a9ab07ce7c06f', '4af79dd6f7f3b483d98c831e62e645570478153a49e2fb9156902f3a931128d6', 'f', NULL, 0, 0, 'f')
---
  def create
  	if signed_in?
      redirect_to current_user
    else
	  @user = User.register_new(params, false)

      if @user.save

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "name" = 'new name', "email" = 'user@example.org', "updated_at" = '2011-02-08 18:07:43.864973', "encrypted_password" = 'dd9b69dae944df194dd88d08b423cca55b0aa385702e3667ba9608c1cc2cc4c2' WHERE ("users"."id" = 1)
---
  def update
  	@user = User.find(params[:id])

    if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE ("users"."id" = 1)
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy